tap "clojure/tools"
tap "koekeishiya/formulae"
tap "sidneys/homebrew"
tap "teamookla/speedtest"
brew "antlr"
brew "aria2"
brew "bat"
brew "cabextract"
brew "cdrtools"
brew "clang-format"
brew "eza"
brew "fish"
brew "fzf"
brew "git"
brew "htop"
brew "llvm"
brew "maven"
brew "pipx"
brew "python@3.12"
brew "ripgrep"
brew "smartmontools"
brew "tldr"
brew "trash-cli"
brew "tree"
brew "wimlib"
brew "yt-dlp"
brew "zoxide"
brew "zplug"
brew "zsh"
brew "zsh-syntax-highlighting"
brew "clojure/tools/clojure"
brew "koekeishiya/formulae/skhd"
brew "sidneys/homebrew/chntpw"
brew "teamookla/speedtest/speedtest"
cask "font-fira-code-nerd-font"
cask "jordanbaird-ice"
cask "stats"
cask "time-out"
vscode "beardedbear.beardedtheme"
vscode "betterthantomorrow.calva"
vscode "betterthantomorrow.calva-spritz"
vscode "charliermarsh.ruff"
vscode "cheshirekow.cmake-format"
vscode "davidanson.vscode-markdownlint"
vscode "donjayamanne.python-extension-pack"
vscode "eamodio.gitlens"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "go2sh.cmake-integration-vscode"
vscode "gruntfuggly.todo-tree"
vscode "kevinrose.vsc-python-indent"
vscode "llvm-vs-code-extensions.vscode-clangd"
vscode "mechatroner.rainbow-csv"
vscode "miguelsolorio.fluent-icons"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "njpwerner.autodocstring"
vscode "njqdev.vscode-python-typehint"
vscode "pkief.material-icon-theme"
vscode "pomdtr.excalidraw-editor"
vscode "shakram02.bash-beautify"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "streetsidesoftware.code-spell-checker"
vscode "tamasfe.even-better-toml"
vscode "tomoki1207.pdf"
vscode "twxs.cmake"
vscode "usernamehw.errorlens"
vscode "wakatime.vscode-wakatime"
vscode "wart.ariake-dark"
vscode "wayou.vscode-todo-highlight"
vscode "zainchen.json"
vscode "zchrissirhcz.cmake-highlight"
