tap "clojure/tools"
tap "hashicorp/tap"
tap "koekeishiya/formulae"
tap "sidneys/homebrew"
tap "teamookla/speedtest"
brew "tree"
brew "ansible"
brew "ansible-lint"
brew "antlr"
brew "argocd"
brew "aria2"
brew "bat"
brew "berkeley-db"
brew "cabextract"
brew "cdrtools"
brew "clang-format"
brew "cowsay"
brew "eza"
brew "ffmpeg"
brew "fish"
brew "fzf"
brew "gh"
brew "git"
brew "gnupg"
brew "helm"
brew "hey"
brew "htop"
brew "kubernetes-cli"
brew "kubectx"
brew "libpq"
brew "llvm"
brew "maven"
brew "minikube"
brew "neovim"
brew "node"
brew "pipx"
brew "python@3.12"
brew "rclone"
brew "redis"
brew "restic"
brew "ripgrep"
brew "smartmontools"
brew "sops"
brew "tlrc"
brew "trash-cli"
brew "uv"
brew "weasyprint"
brew "wimlib"
brew "wireguard-tools"
brew "yt-dlp"
brew "zoxide"
brew "zplug"
brew "zsh"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "clojure/tools/clojure"
brew "hashicorp/tap/terraform"
brew "hashicorp/tap/vault"
brew "koekeishiya/formulae/skhd"
brew "teamookla/speedtest/speedtest"
cask "font-fira-code-nerd-font"
cask "jordanbaird-ice"
cask "karabiner-elements"
cask "orbstack"
cask "stats"
cask "time-out"
vscode "activitywatch.aw-watcher-vscode"
vscode "adpyke.codesnap"
vscode "ahmadalli.vscode-nginx-conf"
vscode "batisteo.vscode-django"
vscode "beardedbear.beardedtheme"
vscode "catppuccin.catppuccin-vsc"
vscode "charliermarsh.ruff"
vscode "cheshirekow.cmake-format"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "eamodio.gitlens"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "gitlab.gitlab-workflow"
vscode "go2sh.cmake-integration-vscode"
vscode "golang.go"
vscode "gruntfuggly.todo-tree"
vscode "hashicorp.terraform"
vscode "hediet.vscode-drawio"
vscode "kevinrose.vsc-python-indent"
vscode "llvm-vs-code-extensions.vscode-clangd"
vscode "lunuan.kubernetes-templates"
vscode "mads-hartmann.bash-ide-vscode"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "njpwerner.autodocstring"
vscode "njqdev.vscode-python-typehint"
vscode "pkief.material-icon-theme"
vscode "pomdtr.excalidraw-editor"
vscode "redhat.ansible"
vscode "redhat.vscode-yaml"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "streetsidesoftware.code-spell-checker"
vscode "tamasfe.even-better-toml"
vscode "tim-koehler.helm-intellisense"
vscode "tomoki1207.pdf"
vscode "twxs.cmake"
vscode "usernamehw.errorlens"
vscode "vintharas.learn-vim"
vscode "wakatime.vscode-wakatime"
vscode "wayou.vscode-todo-highlight"
vscode "wholroyd.jinja"
vscode "zainchen.json"
vscode "zchrissirhcz.cmake-highlight"
go "github.com/bootdotdev/bootdev"
go "golang.org/x/tools/gopls"
go "sigs.k8s.io/kind"
go "github.com/zekker6/mcp-helm/cmd/mcp-helm"
go "honnef.co/go/tools/cmd/staticcheck"
